app/controllers/messages_controller.rb

  def index
    #このgroup_idは/groups/:group_id/messages(.:format)のgroup_idである。参照rake routes
    #group_idをとってくることによってそのグループの情報を取ってくることが出来る。そしてその情報からeditに飛べる。editに跳ぶにはここのindexの情報が必須だった。
    #ここはmessageコントローラーだが、普通に他のテーブルのモデル、例えば上でいうgroupモデルも取ってくる事が出来る。
    @messages = @group.messages.includes(:user)
    @message = Message.new

    respond_to do |format|
      format.html
      format.json {
        @messages = @group.messages.where('id > ?', params[:ID])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 16 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @messages = @group.messages.includes(:user)
    @message = current_user.messages.new(post_params)
    if @message.save
---
INSERT INTO `messages` (`user_id`, `group_id`, `body`, `created_at`, `updated_at`) VALUES (176, 118, 'body desu', '2017-05-12 02:19:54', '2017-05-12 02:19:54')